{
  "week": 17,
  "season": "2025",
  "leagueId": "1235581944008286208",
  "persona": "Peter Crouch",
  "summary": "Right then, Week 17, and what an absolute rollercoaster of emotions we've had. Let me tell you, I've seen some things in my time, but watching Patrick Mahomes put up a lovely round zero for stephen375 while his opponent chitown314 squeaked by with a 1.80-point victory? That's the kind of thing that makes you question your life choices. Joe Burrow dropped 28.4 for chitown314, and somewhere in Kansas City, Mahomes was probably having a nice sit-down. The beautiful game, this is not.\n\nOur hero of the week? Has to be finthefiddle, doesn't it? An absolutely bonkers 187.34 points – and I mean bonkers in the best possible way. Drake Maye with 39.4, Christian McCaffrey reminding everyone he's still got it with 34.1, and even with Jahmyr Gibbs having what I'd diplomatically call \"a quiet one\" at 6.9 points, they still battered raaaaaidddderrrrrs by nearly 45 points. Fair play to raaaaaidddderrrrrs though – Derrick Henry went full King Henry mode with 57.6 points. FIFTY-SEVEN POINT SIX. The man's a machine, and if I had legs like that, I'd probably still be playing. Alas, I had stilts.\n\nNow, our villain – and I use that term with the utmost affection – has to be the collective group of tight ends who decided Week 17 was a lovely time for a nap. T.J. Hockenson, George Kittle, Brock Bowers, Taysom Hill – all posting zeros or thereabouts like they'd agreed to it in a group chat. Poor decdweir put up 145.44 points with Bijan Robinson absolutely doing bits (44.4!), Breece Hall chipping in 26.4, and STILL lost by 2.14 because Kittle gave him nothing. That's the kind of heartbreak that requires a strong cup of tea and a lie-down.\n\nThe margins this week were mental – four matches decided by fewer than 10 points, including that chitown314 squeaker and mikeybhoy's 2.14-point thriller over decdweir. Meanwhile, at the other end, we had some proper batterings. Tmac1418's on a three-week hot streak with Brock Purdy (40.9) and Chase Brown (31.1) doing the business, while poor jamesclarkson96 is limping through a cold spell but somehow scraped past danielb6 despite Marvin Harrison Jr. ghosting harder than my text messages after a night out.\n\nWeek 17 then: where Derrick Henry scored more points than some entire teams, where elite tight ends forgot how to catch, and where 1.80 points was the difference between glory and despair. As I always say, fantasy football is a lot like being 6'7\" at a wedding – sometimes you're the center of attention, and sometimes you're just bumping your head on the ceiling wondering how it all went wrong.",
  "generatedAt": "2026-01-07T10:53:40.905Z",
  "matchupScores": [
    {
      "team1": "bequietamy",
      "team1Score": 64.4,
      "team2": "MarkusArnold",
      "team2Score": 89.36
    },
    {
      "team1": "chitown314",
      "team1Score": 94.9,
      "team2": "stephen375",
      "team2Score": 93.1
    },
    {
      "team1": "decdweir",
      "team1Score": 145.44,
      "team2": "mikeybhoy",
      "team2Score": 147.58
    },
    {
      "team1": "finthefiddle",
      "team1Score": 187.34,
      "team2": "raaaaaidddderrrrrs",
      "team2Score": 142.6
    },
    {
      "team1": "jamesclarkson96",
      "team1Score": 86.12,
      "team2": "danielb6",
      "team2Score": 78.08
    },
    {
      "team1": "jdmorris",
      "team1Score": 113.38,
      "team2": "ChunkyDog1998",
      "team2Score": 107.34
    },
    {
      "team1": "stevenbar24",
      "team1Score": 95.96,
      "team2": "BigBishAl76",
      "team2Score": 115.58
    },
    {
      "team1": "Tmac1418",
      "team1Score": 136.92,
      "team2": "NiallCarslaw",
      "team2Score": 109.08
    }
  ]
}