{
  "week": 10,
  "season": "2025",
  "leagueId": "1182940167115010048",
  "persona": "Stuart Scott",
  "summary": "Boo-yah! Week 10 just dropped the hammer like Thor in the fourth quarter, and we got ourselves a tale of two cities, baby! Cosmohouck came through cooler than the other side of the pillow, dropping a biblical 171.9 points on mastab24 – that's not just a win, that's a violation! My man was serving up points like he's running a Denny's breakfast buffet at 2 AM. Meanwhile, poor Langland put up 50.44 points and got steamrolled by mjgrana's 109.5. That's like bringing a Nerf gun to a bazooka fight, people! And let me tell you, when you're scoring 50 points in fantasy football, you're not just losing – you're getting taken to school, and cosmohouck must be the bus driver!\n\nNow let's talk about this week's hero and villain situation. Cosmohouck is your heavyweight champion, your Michael Jordan in the '96 Finals, your Beyoncé at the Super Bowl – absolutely untouchable with that 171.9! This cat put on a performance that reminds me of when Allen Iverson stepped over Tyronn Lue – just complete domination that'll live in the highlight reel forever. On the flip side, Langland is this week's villain, but not by choice – sometimes the villain is the one who forgot to show up to the party. Dropping 50.44 is like showing up to Thanksgiving dinner with a bag of chips when everybody else brought the whole turkey!\n\nShogunation and Seananigans both brought the heat with 155.3 and 138.18 respectively – those are video game numbers, baby! But here's what kills me about this week: We got five managers who left their best players chilling on the bench like they're LeBron in the fourth quarter of a preseason game. Mastab24 left 20.4 points on the bench, powerperson left 19 on the pine, and Langland left 17.3 just sitting there! Y'all playing fantasy football or fantasy sleeping? That's colder than the other side of the pillow, but in all the wrong ways!\n\nHere's my bold prediction for Week 11: Cosmohouck is coming back down to Earth like gravity just remembered he exists. You can't drop 171 two weeks in a row – that's like catching lightning in a bottle twice, and Mother Nature doesn't work that way. Meanwhile, Langland's gonna bounce back harder than a rubber band snapping back, because nowhere to go but up when you're at 50.44! And watch out for Tishathefish, who squeaked by with that 9.8-point nail-biter – that's championship DNA right there, winning ugly when you gotta win ugly. As cool as the other side of the pillow, that's how we do it in Week 10! Boo-yah!",
  "generatedAt": "2025-11-25T01:32:26.879Z",
  "matchupScores": [
    {
      "team1": "drobs",
      "team1Score": 80.02,
      "team2": "TophTT",
      "team2Score": 68.68
    },
    {
      "team1": "Langland",
      "team1Score": 50.44,
      "team2": "mjgrana",
      "team2Score": 109.5
    },
    {
      "team1": "mastab24",
      "team1Score": 75.24,
      "team2": "cosmohouck",
      "team2Score": 171.9
    },
    {
      "team1": "powerperson",
      "team1Score": 69.7,
      "team2": "Tishathefish",
      "team2Score": 79.5
    },
    {
      "team1": "Seananigans",
      "team1Score": 138.18,
      "team2": "tr4sh",
      "team2Score": 95.26
    },
    {
      "team1": "Shogunation",
      "team1Score": 155.3,
      "team2": "PrinceofPizza",
      "team2Score": 127.56
    }
  ]
}