{
  "week": 9,
  "season": "2025",
  "leagueId": "1182940167115010048",
  "persona": "Pat McAfee",
  "summary": "LADIES AND GENTLEMEN, WELCOME TO THE ABSOLUTE CHAOS THAT WAS WEEK 9! LETS GOOOOO! We had some BANGERS, we had some absolute STINKERS, and we had \"The Professor\" mjgrana put on a CLINIC that had me jumping out of my seat! This guy dropped 180.04 points – ONE-EIGHTY POINT ZERO-FOUR – on poor Tishathefish's head like a steel chair from the top rope! That's a 98.56 point beatdown, and I'm pretty sure that's illegal in 47 states! BOOM! Meanwhile, we got Langland over here scoring 62.02 points, which is basically showing up to a gunfight with a pool noodle. That's TOUGH, man!\n\nSpeaking of absolute DOMINATION, \"The Shogun\" himself put up 135.4 and sent powerperson to the SHADOW REALM with a 61.50 point victory! That's back-to-back DESTRUCTIONS in this league! But here's where it gets SPICY – we got ourselves a RIVALRY brewing between PrinceofPizza and drobs! The Prince came in SWINGING with 146.06 points and handed drobs a 31.76 point loss, FOR THE BRAND! These two are clearly on a collision course, and I am HERE for it! Seananigans also showed up with 109.34 to handle Langland's business, while cosmohouck snuck past tr4sh by 12.36 in the closest game of the week – and brother, when THAT'S your closest game, you know it was a BLOWOUT BONANZA!\n\nNow, we gotta talk about the ATROCITIES! PrinceofPizza, my guy, you WON by 31 points but you STILL left points on the bench like you're running a charity! Multiple lineup decisions that had me screaming at my television! But here's the thing – you still got the DUB, so I guess we'll let it slide! Tishathefish, buddy, you got SMOKED by The Professor and ALSO left 16.6 points chilling on your bench like they're on vacation! That's like bringing a backup quarterback to the Super Bowl and leaving Patrick Mahomes in the parking lot! WHAT ARE WE DOING?!\n\nThis week was ELECTRIC from start to finish! The average score was 108.28, but we had ZERO games decided by less than 10 points, which means everybody either showed up to DOMINATE or got absolutely PANTSED in front of the entire league! mjgrana is clearly the team to beat right now – The Professor is teaching a MASTERCLASS in fantasy football! Shogunation is RIGHT behind him with that HAMMER of a performance! And to Langland and powerperson – fellas, the good news is you can only go UP from here! Next week, we run it back, and I expect EVERYONE to bring that JUICE! FOR THE BRAND! BOOM!",
  "generatedAt": "2025-11-25T01:32:06.760Z",
  "matchupScores": [
    {
      "team1": "drobs",
      "team1Score": 114.3,
      "team2": "PrinceofPizza",
      "team2Score": 146.06
    },
    {
      "team1": "Langland",
      "team1Score": 62.02,
      "team2": "Seananigans",
      "team2Score": 109.34
    },
    {
      "team1": "mastab24",
      "team1Score": 115.92,
      "team2": "TophTT",
      "team2Score": 94.88
    },
    {
      "team1": "mjgrana",
      "team1Score": 180.04,
      "team2": "Tishathefish",
      "team2Score": 81.48
    },
    {
      "team1": "Shogunation",
      "team1Score": 135.4,
      "team2": "powerperson",
      "team2Score": 73.9
    },
    {
      "team1": "tr4sh",
      "team1Score": 86.84,
      "team2": "cosmohouck",
      "team2Score": 99.2
    }
  ]
}