{
  "week": 14,
  "season": "2025",
  "leagueId": "1182940167115010048",
  "persona": "Lee Corso",
  "summary": "**HOLD ON TO YOUR HELMETS, FOLKS, BECAUSE WEEK 14 JUST DELIVERED MORE DRAMA THAN A COLLEGE FOOTBALL RIVALRY WEEKEND!**\n\nOH BOY, OH BOY, OH BOY! Let me tell you about the absolute CARNAGE we witnessed this week! Tishathefish just put on an absolute CLINIC, dropping 132.62 points on poor Langland like a ton of bricks! And get this – Michael Wilson exploded for 31.7 points and Jaxon Smith-Njigba added 24.6, turning Tishathefish into \"The Big Fish\" this week! Meanwhile, Langland's sitting there with Josh Allen throwing up a magnificent 37.8 points – THE TOP QUARTERBACK OF THE ENTIRE WEEK – and it STILL wasn't enough! Not even close! That's a 54.58-point beatdown, my friend. When you lose by that much despite having the league's best QB performance, uh oh, you've got problems everywhere else!\n\nBut wait, NOT SO FAST MY FRIEND! Let's talk about the nail-biter that had everyone on the edge of their seats! Shogunation squeaked past drobs by just 4.34 points in a battle that came down to the wire! Jahmyr Gibbs was an absolute MONSTER with 33.5 points – the second-best performance of the entire week – carrying Shogunation to victory. And you know what? Shogunation needed every single one of those points because Travis Kelce laid a complete EGG with 1.3 points! Sam Darnold tried to play hero for drobs with 22.3 points, but when Mark Andrews gives you 1.4 and Kenneth Walker stumbles to 3.3, you're fighting an uphill battle! This team's on a two-week hot streak and STILL came up just short!\n\nNow let me tell you about \"The Pizza Man\" – PrinceofPizza delivered a special order of whoop-you-know-what to mastab24! Tee Higgins went absolutely BANANAS with 24.2 points and De'Von Achane rushed for 17.0, leading PrinceofPizza to a 97.4-82.76 victory. But here's the kicker – mastab24 usually averages 118.1 points and has been SCORCHING lately at 141.7, but Jalen Hurts went down with an injury and posted 0.4 points! POINT-FOUR! You can't win fantasy football games when your starting quarterback gives you less than half a point, folks! Meanwhile, powerperson – let's call him \"The Comeback Kid\" because this team's been struggling all season at 81.1 average – absolutely DEMOLISHED tr4sh 110.88 to 65.1! Blake Corum rushed for 25.6 points while tr4sh is in complete freefall on a FOUR-WEEK COLD STREAK! When Justin Jefferson only gets you 2.1 points and Tyrod Taylor goes NEGATIVE with -1.8, you're not just cold, you're FROZEN SOLID!\n\nOH, and one more thing before I put on the headgear – Puka Nacua had himself a WEEK with 32.2 points across the league! This is playoff time, people, and the cream is rising to the top while teams like Langland (trending down at 48.8 recent average) and tr4sh (69.3 recent average – YIKES!) are sinking faster than my golf ball in a water hazard! Week 14 is when champions are made and pretenders are exposed! **NOT SO FAST, MY FRIENDS – THE FANTASY PLAYOFFS ARE HERE, AND IT'S ABOUT TO GET EVEN CRAZIER!**",
  "generatedAt": "2025-12-10T10:08:38.445Z",
  "matchupScores": [
    {
      "team1": "drobs",
      "team1Score": 114.14,
      "team2": "Shogunation",
      "team2Score": 118.48
    },
    {
      "team1": "Langland",
      "team1Score": 78.04,
      "team2": "Tishathefish",
      "team2Score": 132.62
    },
    {
      "team1": "mastab24",
      "team1Score": 82.76,
      "team2": "PrinceofPizza",
      "team2Score": 97.4
    },
    {
      "team1": "powerperson",
      "team1Score": 110.88,
      "team2": "tr4sh",
      "team2Score": 65.1
    }
  ]
}