{
  "week": 12,
  "season": "2025",
  "leagueId": "1182940167115010048",
  "persona": "Lee Corso",
  "summary": "OH BOY, OH BOY, OH BOY! Week 12 just gave us more fireworks than a Fourth of July celebration, folks! We had blowouts, we had heartbreak, and we had some managers who clearly forgot to check their lineup apps! Let me tell you, when Jahmyr Gibbs puts up 49.9 points – FORTY-NINE POINT NINE! – you better believe somebody's going home happy, and NOT SO FAST MY FRIEND if you thought you had a chance against Shogunation! This man is riding a rocket ship, averaging 146.7 points recently and trending UP like a hot air balloon! Meanwhile, Langland scored 26.42 points. TWENTY-SIX! My grandmother's bingo league puts up more points than that!\n\nLet's talk about \"The Demolition Man\" mastab24, who absolutely OBLITERATED Tishathefish by 97.24 points! When you're putting up 184.62 points with Jalen Hurts dropping 30.9 and Emanuel Wilson contributing 25.5, you're not just winning – you're making a STATEMENT! And here's the kicker – Tishathefish had Jaxon Smith-Njigba going off for 33.1 and Amon-Ra St. Brown adding 25.4, but UH OH! When Tua Tagovailoa and Jordan Addison combine for a big fat ZERO, you're cooked faster than Thanksgiving turkey! That's the biggest blowout of the week, and it wasn't even close!\n\nBut NOT SO FAST on crowning Shogunation just yet! We've got ourselves a brewing RIVALRY between Shogunation and cosmohouck – both these juggernauts are humming along with season averages over 125 points! Shogunation just steamrolled tr4sh by 82.74 points behind that monster Gibbs performance and Dak Prescott's 27.1 points. Meanwhile, cosmohouck is sitting pretty with a 143.4 recent average, taking down powerperson with Matthew Stafford's 22.9 and Drake Maye's 16.0. These two powerhouses haven't faced each other yet, but when they do? OH BOY, clear your schedule!\n\nNow let me tell you about \"The Cardiac Kid\" PrinceofPizza, who squeaked by Seananigans 97.4 to 82.34 in the closest game of the week! When your best performer is Ashton Jeanty with 20.8 and you're starting Daniel Jones at quarterback – DANIEL JONES! – and still winning, you take it and run! Meanwhile, drobs earned himself the nickname \"Hunt Master\" after Kareem Hunt's 18.5 points led him to a convincing victory despite Jameson Williams laying a goose egg. And mjgrana? Christian McCaffrey is BACK, baby, with 23.7 points paired with George Pickens' 25.1! That's how you overcome Baker Mayfield's pitiful 3.5-point performance!\n\nHere's my bold prediction for next week: This Shogunation-cosmohouck rivalry is going to determine this league's championship! Both teams are peaking at the right time, and when you've got teams consistently putting up 140-plus points, everybody else better WATCH OUT! And one more thing – tr4sh and Seananigans, you're both on two-week cold streaks. Time to put on the headgear, folks, because you're about to get LEFT BEHIND if you don't turn it around! OH BOY, I can't wait for Week 13!",
  "generatedAt": "2025-11-26T10:08:12.204Z",
  "matchupScores": [
    {
      "team1": "drobs",
      "team1Score": 74.54,
      "team2": "Langland",
      "team2Score": 26.42
    },
    {
      "team1": "mastab24",
      "team1Score": 184.62,
      "team2": "Tishathefish",
      "team2Score": 87.38
    },
    {
      "team1": "mjgrana",
      "team1Score": 104.76,
      "team2": "TophTT",
      "team2Score": 71.28
    },
    {
      "team1": "powerperson",
      "team1Score": 86.74,
      "team2": "cosmohouck",
      "team2Score": 108.68
    },
    {
      "team1": "PrinceofPizza",
      "team1Score": 97.4,
      "team2": "Seananigans",
      "team2Score": 82.34
    },
    {
      "team1": "Shogunation",
      "team1Score": 158.92,
      "team2": "tr4sh",
      "team2Score": 76.18
    }
  ]
}