{
  "week": 11,
  "season": "2025",
  "leagueId": "1182940167115010048",
  "persona": "Stuart Scott",
  "summary": "Boo-yah! Week 11 just rolled through this league like a hurricane through a house of cards, and let me tell you something - there were no nail-biters, no photo finishes, no last-second drama. Not a single game decided by fewer than 22 points! This wasn't a week of close calls; this was a week of straight-up domination, where the winners were cooler than the other side of the pillow and the losers... well, they just got taken to school.\n\nLet's talk about your hero and your villain, because every great story needs both. Cosmohouck is your hero this week, baby, dropping a league-best 149.64 points on poor Tishathefish like LeBron in the fourth quarter. That's a 60-point beatdown - the biggest blowout of the week! He must be the bus driver because he was takin' Tishathefish to school! Meanwhile, your villain? That's powerperson, limping to the finish line with a measly 43.36 points, getting walloped by mastab24 by nearly 40. When you're scoring 56 points below the league average, you're not just cold - you're frozen solid.\n\nNow let's keep it real about these lineup decisions, because some of y'all need to check yourselves before you wreck yourselves. PrinceofPizza left 23.4 points chilling on the bench like they didn't matter - and you still won! That's like showing up to the game with one shoe and still dropping 30. Tishathefish had 20.8 points watching from the sidelines while getting demolished, and TophTT made not one but TWO questionable calls. Y'all are making decisions with your eyes closed!\n\nThe complete rundown shows mjgrana putting up 145.18 to smoke drobs, Shogunation rolling with 125.76 to handle Seananigans, and PrinceofPizza squeaking past tr4sh despite leaving those bench points stranded. This week was all about separation - six games, zero drama, and a whole lot of teams getting embarrassed. That's how Week 11 went down, and as always, you can't stop it, you can only hope to contain it! Boo-yah!",
  "generatedAt": "2025-11-25T01:32:43.798Z",
  "matchupScores": [
    {
      "team1": "cosmohouck",
      "team1Score": 149.64,
      "team2": "Tishathefish",
      "team2Score": 89.34
    },
    {
      "team1": "drobs",
      "team1Score": 106.54,
      "team2": "mjgrana",
      "team2Score": 145.18
    },
    {
      "team1": "Langland",
      "team1Score": 68.88,
      "team2": "TophTT",
      "team2Score": 91.58
    },
    {
      "team1": "mastab24",
      "team1Score": 81.8,
      "team2": "powerperson",
      "team2Score": 43.36
    },
    {
      "team1": "PrinceofPizza",
      "team1Score": 111.72,
      "team2": "tr4sh",
      "team2Score": 88.46
    },
    {
      "team1": "Shogunation",
      "team1Score": 125.76,
      "team2": "Seananigans",
      "team2Score": 86.02
    }
  ]
}