{
  "tradeId": "671f5244f4db33d7",
  "week": 8,
  "season": "2023",
  "leagueId": "1182940167115010048",
  "participants": [
    "Shogunation",
    "drobs"
  ],
  "sides": [
    {
      "teamName": "drobs",
      "teamContext": "Playoff contender - competitive",
      "powerScore": {
        "powerScore": 51.3,
        "powerRank": 6,
        "lineupValueScore": 53.3,
        "performanceScore": 57.3,
        "positionalScore": 36.8,
        "depthScore": 38,
        "totalTeams": 12,
        "totalRosterValue": 25560
      },
      "tradeImpact": {
        "valueGained": 0,
        "valueLost": 284,
        "netValueChange": -284,
        "estimatedPowerScoreChange": -0.3,
        "playersGained": [],
        "playersLost": [
          {
            "name": "Tyjae Spears",
            "value": 284
          }
        ]
      },
      "receives": [
        {
          "name": "Roschon Johnson",
          "position": "RB",
          "team": "CHI",
          "age": 24,
          "careerStage": "Entering Prime"
        },
        {
          "name": "2026 Round 2 pick",
          "position": "PICK"
        }
      ],
      "gives": [
        {
          "name": "Tyjae Spears",
          "position": "RB",
          "team": "TEN",
          "age": 24,
          "careerStage": "Entering Prime"
        }
      ]
    },
    {
      "teamName": "Shogunation",
      "teamContext": "Strong contender - win-now mode",
      "powerScore": {
        "powerScore": 76.4,
        "powerRank": 4,
        "lineupValueScore": 79,
        "performanceScore": 78.2,
        "positionalScore": 62.7,
        "depthScore": 80.9,
        "totalTeams": 12,
        "totalRosterValue": 37890
      },
      "tradeImpact": {
        "valueGained": 284,
        "valueLost": 0,
        "netValueChange": 284,
        "estimatedPowerScoreChange": 0.3,
        "playersGained": [
          {
            "name": "Tyjae Spears",
            "value": 284
          }
        ],
        "playersLost": []
      },
      "receives": [
        {
          "name": "Tyjae Spears",
          "position": "RB",
          "team": "TEN",
          "age": 24,
          "careerStage": "Entering Prime"
        }
      ],
      "gives": [
        {
          "name": "Roschon Johnson",
          "position": "RB",
          "team": "CHI",
          "age": 24,
          "careerStage": "Entering Prime"
        },
        {
          "name": "2026 Round 2 pick",
          "position": "PICK"
        }
      ]
    }
  ],
  "draftPicks": [
    {
      "season": "2026",
      "round": 2,
      "from": "Shogunation",
      "to": "drobs"
    }
  ],
  "persona": "Ian Rapoport",
  "analysis": "My understanding is that this deal came together in Week 8 with Shogunation making a calculated push to solidify their playoff positioning. Sources indicate the strong contender at 76.4 power score was willing to part with a future second-rounder to upgrade at the RB2/flex spot—and folks, that's exactly what win-now teams do. The value metrics tell the story here: Shogunation netted a +284 value swing while drobs took a -284 hit. When you're ranked 4th and stacked across the board with an 80.9 depth score, you can afford to trade future capital for immediate production. Tyjae Spears was averaging 5.8 PPG at the time compared to Roschon Johnson's 4.3, and in fantasy football, those 1.5 points per game can be the difference between a championship run and an early exit.\n\nNow, here's where it gets interesting, folks. Keep an eye on this developing situation because neither back really separated themselves post-trade—Spears actually declined slightly to 5.2 PPG while Johnson stayed virtually flat at 4.2 PPG. My sources tell me drobs was hoping Johnson's role in Chicago would expand, but the Bears' backfield remained a committee approach. For Shogunation, they got the marginal upgrade they needed, but we're talking about backup running backs in murky depth charts here. The 2026 second-round pick might not seem like much now, but in dynasty leagues, that's future currency that could turn into a legitimate starter.\n\nLet me make a bold prediction: in two years, drobs will regret giving up that 2026 pick for what amounted to a lateral move between two backup running backs. When you're sitting at a 51.3 power score—ranked 6th of 12—you need to be accumulating assets, not trading them away for minimal upgrades. The winner here is clearly Shogunation, who leveraged their depth and competitive position to make a smart win-now move while essentially getting a free second-round pick in the process. My understanding is both these backs are replacement-level talents, which means the real value in this trade was always that draft capital. Sometimes in this league, you've got to know when you're the team buying and when you're the team that should be selling—and drobs got caught in between.",
  "generatedAt": "2025-12-28T21:40:23.667Z"
}