{
  "tradeId": "9b5c541d50df00a7",
  "week": 9,
  "season": "2022",
  "leagueId": "1182940167115010048",
  "participants": [
    "powerperson",
    "drobs"
  ],
  "sides": [
    {
      "teamName": "drobs",
      "teamContext": "Playoff contender - competitive",
      "powerScore": {
        "powerScore": 51.3,
        "powerRank": 6,
        "lineupValueScore": 53.3,
        "performanceScore": 57.3,
        "positionalScore": 36.8,
        "depthScore": 38,
        "totalTeams": 12,
        "totalRosterValue": 25560
      },
      "tradeImpact": {
        "valueGained": 0,
        "valueLost": 0,
        "netValueChange": 0,
        "estimatedPowerScoreChange": 0,
        "playersGained": [],
        "playersLost": []
      },
      "receives": [
        {
          "name": "2025 Round 3 pick",
          "position": "PICK"
        }
      ],
      "gives": [
        {
          "name": "Chase Edmonds",
          "position": "RB",
          "team": "WAS",
          "age": 29,
          "careerStage": "Declining"
        }
      ]
    },
    {
      "teamName": "powerperson",
      "teamContext": "Rebuilding - future-focused",
      "powerScore": {
        "powerScore": 23.8,
        "powerRank": 11,
        "lineupValueScore": 26.4,
        "performanceScore": 21.6,
        "positionalScore": 20.9,
        "depthScore": 19.1,
        "totalTeams": 12,
        "totalRosterValue": 12690
      },
      "tradeImpact": {
        "valueGained": 0,
        "valueLost": 0,
        "netValueChange": 0,
        "estimatedPowerScoreChange": 0,
        "playersGained": [],
        "playersLost": []
      },
      "receives": [
        {
          "name": "Chase Edmonds",
          "position": "RB",
          "team": "WAS",
          "age": 29,
          "careerStage": "Declining"
        }
      ],
      "gives": [
        {
          "name": "2025 Round 3 pick",
          "position": "PICK"
        }
      ]
    }
  ],
  "draftPicks": [
    {
      "season": "2025",
      "round": 3,
      "from": "powerperson",
      "to": "drobs"
    }
  ],
  "persona": "Mel Kiper Jr.",
  "analysis": "Look, let me tell you something about Chase Edmonds - and I've been studying this guy since his Fordham days where he put up RIDICULOUS numbers in the FCS. This is a classic case of a playoff contender recognizing when a veteran running back has hit the wall, and folks, the tape doesn't lie here. When I see a 29-year-old back with seven years of NFL wear-and-tear averaging 5.0 points per game, I'm already projecting the decline curve, and sure enough, post-trade he drops to 2.4 PPG? That's not regression, that's a CLIFF. drobs made the smart move here - they're sitting at 6th in the power rankings trying to make a playoff push in Week 9, and they correctly identified that Edmonds wasn't moving the needle for their championship window. Getting ANY draft capital, even a 2025 third-rounder, for a declining asset is addition by subtraction.\n\nNow, powerperson - and I'm going to be blunt here because that's what I do - this is BAFFLING for a rebuilding team sitting at 11th out of 12! You're trading future draft capital, which is the LIFEBLOOD of a rebuild, for a 29-year-old running back who's already showing decline? This isn't about upside, this isn't about ceiling - there IS no ceiling left! When you're rebuilding, you need to be accumulating picks, not hemorrhaging them for veterans in their career twilight. This reminds me of when the Browns traded for Trent Richardson - everyone could see the warning signs, but somebody convinced themselves they were getting value. The metrics here are SCREAMING at you: both teams projected at zero power score change because Edmonds had essentially no value!\n\nHere's my winner: drobs in a LANDSLIDE. They essentially got a free third-round pick for a roster clogger who was giving them nothing. This is like the Patriots trading a fifth-rounder for Mohamed Sanu when they knew he was cooked - except drobs is on the RIGHT side of this deal. And let me make a bold prediction - in two years, that 2025 third-rounder could be a productive young asset, while Chase Edmonds will be out of the league or buried on a depth chart. When you're at 23.8 power score trying to rebuild, you BUILD THROUGH THE DRAFT. You don't mortgage picks for running backs on their last legs. I had Edmonds penciled in as \"avoid\" on my dynasty board even before this trade, and nothing I've seen changes that evaluation. The tape doesn't lie, folks!",
  "generatedAt": "2025-12-28T21:46:46.775Z"
}