{
  "tradeId": "17baaf65157ab417",
  "week": 3,
  "season": "2025",
  "leagueId": "1235581944008286208",
  "participants": [
    "bequietamy",
    "Tmac1418"
  ],
  "sides": [
    {
      "teamName": "bequietamy",
      "teamContext": "Playoff contender - competitive",
      "powerScore": {
        "powerScore": 32.4,
        "powerRank": 13,
        "lineupValueScore": 28.8,
        "performanceScore": 43.1,
        "positionalScore": 32.4,
        "depthScore": 4.2,
        "totalTeams": 16,
        "totalRosterValue": 17294
      },
      "tradeImpact": {
        "valueGained": 597,
        "valueLost": 2429,
        "netValueChange": -1832,
        "estimatedPowerScoreChange": -1.5,
        "playersGained": [
          {
            "name": "Evan Engram",
            "value": 138
          },
          {
            "name": "Romeo Doubs",
            "value": 459
          }
        ],
        "playersLost": [
          {
            "name": "Juwan Johnson",
            "value": 117
          },
          {
            "name": "Luther Burden",
            "value": 2312
          }
        ]
      },
      "receives": [
        {
          "name": "Evan Engram",
          "position": "TE",
          "team": "DEN",
          "age": 31,
          "careerStage": "Prime Years"
        },
        {
          "name": "Romeo Doubs",
          "position": "WR",
          "team": "GB",
          "age": 25,
          "careerStage": "Entering Prime"
        }
      ],
      "gives": [
        {
          "name": "Juwan Johnson",
          "position": "TE",
          "team": "NO",
          "age": 29,
          "careerStage": "Prime Years"
        },
        {
          "name": "Luther Burden",
          "position": "WR",
          "team": "CHI",
          "age": 22,
          "careerStage": "Developing"
        }
      ]
    },
    {
      "teamName": "Tmac1418",
      "teamContext": "Middle of pack - unclear direction",
      "powerScore": {
        "powerScore": 36.1,
        "powerRank": 9,
        "lineupValueScore": 29.8,
        "performanceScore": 49.8,
        "positionalScore": 35.6,
        "depthScore": 18.9,
        "totalTeams": 16,
        "totalRosterValue": 17875
      },
      "tradeImpact": {
        "valueGained": 2429,
        "valueLost": 597,
        "netValueChange": 1832,
        "estimatedPowerScoreChange": 1.5,
        "playersGained": [
          {
            "name": "Juwan Johnson",
            "value": 117
          },
          {
            "name": "Luther Burden",
            "value": 2312
          }
        ],
        "playersLost": [
          {
            "name": "Evan Engram",
            "value": 138
          },
          {
            "name": "Romeo Doubs",
            "value": 459
          }
        ]
      },
      "receives": [
        {
          "name": "Juwan Johnson",
          "position": "TE",
          "team": "NO",
          "age": 29,
          "careerStage": "Prime Years"
        },
        {
          "name": "Luther Burden",
          "position": "WR",
          "team": "CHI",
          "age": 22,
          "careerStage": "Developing"
        }
      ],
      "gives": [
        {
          "name": "Evan Engram",
          "position": "TE",
          "team": "DEN",
          "age": 31,
          "careerStage": "Prime Years"
        },
        {
          "name": "Romeo Doubs",
          "position": "WR",
          "team": "GB",
          "age": 25,
          "careerStage": "Entering Prime"
        }
      ]
    }
  ],
  "draftPicks": [],
  "persona": "Gary Lineker",
  "analysis": "Well, well, well – this is one of those trades that makes you squint at the numbers and wonder if someone's fantasy app was showing them a completely different set of players. Let me introduce you to \"The Value Visionary,\" Tmac1418, who's somehow convinced \"The Rookie Romantic,\" bequietamy, to part with Luther Burden – a 22-year-old rookie valued at 2,312 trade points – in exchange for a pair of aging veterans whose combined value barely cracks 600. It's the sort of lopsided affair that reminds me of those Sunday morning kickoffs where one team simply hasn't turned up.\n\nNow, bequietamy is clearly smitten with the idea of experienced veterans – hence the Rookie Romantic nickname – shipping out a developing first-year player for Evan Engram and Romeo Doubs. The problem is we're in a redraft league, not building for 2027. And here's where it gets particularly painful: all four players in this deal show zero projected points for the rest of season. Zero. That's your clue something's gone horribly wrong with the data, but even accounting for that, the underlying values tell the real story. Luther Burden was drafted in the 9th round and carries that 2,312 value for a reason – he's the Bears' developing receiver with upside *this season*. Engram's 31 years old, averaging 6.7 PPG over 34 career games, and Doubs is stuck in Green Bay's rotating cast of receivers behind Christian Watson and Jayden Reed. This is trading a potential WR2/3 for two flex plays at best, and bequietamy's power score dropping 1.5 points confirms it.\n\nThe Rookie Romantic's trading history shows seven career trades with 11 players acquired versus eight sent out – they're typically balanced, not reckless. Which makes this move all the more baffling. At 1-1 with a measly 32.4 power score ranking them 13th of 16, this team needed upside, not veteran floor players who'll get you 7-8 points while Luther Burden potentially breaks out in Chicago's offense. Meanwhile, The Value Visionary at 2-0 with a 36.1 power score has pulled off the heist of the early season. Tmac1418 has only made two career trades, and this second one might've just won them a playoff spot by stealing a developing asset for pennies on the pound.\n\nIt's a fascinating bit of early season panic really, the sort that happens when small sample sizes meet impatience. But in redraft, you can't afford these mistakes – there's no \"rebuilding year\" to fall back on. The Value Visionary wins this one by a country mile, gaining 1,832 in net value while bequietamy hemorrhages roster strength in Week 3. As we used to say, it's a game of two halves, but The Rookie Romantic lost both of them in this exchange. One team's climbed the table; the other's made their playoff push significantly steeper. And that, as they say, is football.",
  "generatedAt": "2025-12-30T21:32:16.028Z"
}