{
  "tradeId": "89f18b91a30a5407",
  "week": 1,
  "season": "2023",
  "leagueId": "1182940167115010048",
  "participants": [
    "Shogunation",
    "powerperson"
  ],
  "sides": [
    {
      "teamName": "Shogunation",
      "teamContext": "Strong contender - win-now mode",
      "powerScore": {
        "powerScore": 76.4,
        "powerRank": 4,
        "lineupValueScore": 79,
        "performanceScore": 78.2,
        "positionalScore": 62.7,
        "depthScore": 80.9,
        "totalTeams": 12,
        "totalRosterValue": 37890
      },
      "tradeImpact": {
        "valueGained": 1703,
        "valueLost": 495,
        "netValueChange": 1208,
        "estimatedPowerScoreChange": 1.3,
        "playersGained": [
          {
            "name": "Davante Adams",
            "value": 1703
          }
        ],
        "playersLost": [
          {
            "name": "Chris Godwin",
            "value": 495
          }
        ]
      },
      "receives": [
        {
          "name": "Davante Adams",
          "position": "WR",
          "team": "LAR",
          "age": 32,
          "careerStage": "Declining"
        }
      ],
      "gives": [
        {
          "name": "Chris Godwin",
          "position": "WR",
          "team": "TB",
          "age": 29,
          "careerStage": "Prime Years"
        },
        {
          "name": "2025 Round 2 pick",
          "position": "PICK"
        }
      ]
    },
    {
      "teamName": "powerperson",
      "teamContext": "Rebuilding - future-focused",
      "powerScore": {
        "powerScore": 23.8,
        "powerRank": 11,
        "lineupValueScore": 26.4,
        "performanceScore": 21.6,
        "positionalScore": 20.9,
        "depthScore": 19.1,
        "totalTeams": 12,
        "totalRosterValue": 12690
      },
      "tradeImpact": {
        "valueGained": 495,
        "valueLost": 1703,
        "netValueChange": -1208,
        "estimatedPowerScoreChange": -1.3,
        "playersGained": [
          {
            "name": "Chris Godwin",
            "value": 495
          }
        ],
        "playersLost": [
          {
            "name": "Davante Adams",
            "value": 1703
          }
        ]
      },
      "receives": [
        {
          "name": "Chris Godwin",
          "position": "WR",
          "team": "TB",
          "age": 29,
          "careerStage": "Prime Years"
        },
        {
          "name": "2025 Round 2 pick",
          "position": "PICK"
        }
      ],
      "gives": [
        {
          "name": "Davante Adams",
          "position": "WR",
          "team": "LAR",
          "age": 32,
          "careerStage": "Declining"
        }
      ]
    }
  ],
  "draftPicks": [
    {
      "season": "2025",
      "round": 2,
      "from": "Shogunation",
      "to": "powerperson"
    }
  ],
  "persona": "Todd McShay",
  "analysis": "Look, when I see a contender at #4 in the power rankings giving up draft capital to acquire a 32-year-old receiver, I know exactly what's happening here – Shogunation is going all-in on a championship window. And you know what? I actually love this move for them. This is classic win-now roster construction. They're getting tremendous value in terms of immediate production, swapping a Chris Godwin who's been underwhelming at 9.4 PPG for Davante Adams who's still putting up 15.5 per game. That's a 6-point upgrade at a critical position, and when you're sitting at 76.4 power score with a legitimate shot at a title, you mortgage the future for present-day dominance. The 2025 second-rounder? That's the price of doing business when you're a contender. This is exactly what aggressive, balanced traders should be doing – identifying their window and attacking it.\n\nNow let's talk about powerperson, because this is where it gets interesting. You're sitting at 23.8 power score – that's #11 out of 12 teams – and you're trading away your best asset? This is either brilliant asset management or a catastrophic miscalculation. Here's the thing: Adams' dynasty value is cratering. He's 32, he's in decline phase, and that 1,703 value isn't sustainable. Powerperson is recognizing that their window isn't now, so they're extracting maximum value before Adams becomes unstartable. Getting Godwin at 29 – still in his prime years – plus a second-round pick is actually solid return. But here's my concern: you're a rebuilding team acquiring a 29-year-old receiver who's also trending toward his decline. That's not best player available philosophy; that's getting decent value but missing the bigger picture.\n\nThe risk-reward profiles here are drastically different. Shogunation is risking future assets for immediate production – if they don't win the championship in the next 1-2 years while Adams is still viable, they've mortgaged capital for nothing. But with an 80.9 depth score and 79 lineup value, they've got the infrastructure to absorb that risk. Powerperson is risking that Godwin doesn't provide enough value to justify moving an elite producer, even an aging one. When you're already at the bottom of the standings, you need home run swings on young talent, not lateral moves for guys with one good year left. That second-rounder better hit, or this trade becomes a massive lost opportunity.\n\nLet me be crystal clear about the winner here: Shogunation wins this trade, and it's not particularly close. They're getting a 1.3 power score bump while powerperson drops 1.3 – that's a 2.6 point swing in a tight playoff race. The championship implications are significant: Shogunation just turned themselves from a fringe contender into a legitimate threat, while powerperson remains firmly in rebuild mode without acquiring the type of foundational pieces that actually turn franchises around. Here's my bold prediction: two years from now, we'll look back and see that Shogunation won a championship in 2023 or 2024 with Adams as a key contributor, making this an absolute steal. Meanwhile, Godwin will have declined faster than expected, and powerperson will wish they'd extracted a first-rounder or targeted younger assets. This is the difference between teams that understand their competitive window and teams that make moves just to make moves. Value matters, but so does timing – and Shogunation nailed both.",
  "generatedAt": "2025-12-29T01:48:23.258Z"
}