{
  "tradeId": "5c492f1ec28db916",
  "week": 2,
  "season": "2025",
  "leagueId": "1182940167115010048",
  "participants": [
    "PrinceofPizza",
    "powerperson"
  ],
  "sides": [
    {
      "teamName": "PrinceofPizza",
      "teamContext": "Playoff contender - competitive",
      "powerScore": {
        "powerScore": 80.8,
        "powerRank": 3,
        "lineupValueScore": 89.3,
        "performanceScore": 63.7,
        "positionalScore": 86.5,
        "depthScore": 81,
        "totalTeams": 12,
        "totalRosterValue": 42833
      },
      "tradeImpact": {
        "valueGained": 2389,
        "valueLost": 0,
        "netValueChange": 2389,
        "estimatedPowerScoreChange": 2.5,
        "playersGained": [
          {
            "name": "Daniel Jones",
            "value": 2389
          }
        ],
        "playersLost": []
      },
      "receives": [
        {
          "name": "Daniel Jones",
          "position": "QB",
          "team": "IND",
          "age": 28,
          "careerStage": "Entering Prime"
        },
        {
          "name": "2026 Round 2 pick",
          "position": "PICK"
        }
      ],
      "gives": [
        {
          "name": "2027 Round 1 pick",
          "position": "PICK"
        }
      ]
    },
    {
      "teamName": "powerperson",
      "teamContext": "Rebuilding - future-focused",
      "powerScore": {
        "powerScore": 23.8,
        "powerRank": 11,
        "lineupValueScore": 26.4,
        "performanceScore": 21.6,
        "positionalScore": 20.9,
        "depthScore": 19.1,
        "totalTeams": 12,
        "totalRosterValue": 12690
      },
      "tradeImpact": {
        "valueGained": 0,
        "valueLost": 2389,
        "netValueChange": -2389,
        "estimatedPowerScoreChange": -2.5,
        "playersGained": [],
        "playersLost": [
          {
            "name": "Daniel Jones",
            "value": 2389
          }
        ]
      },
      "receives": [
        {
          "name": "2027 Round 1 pick",
          "position": "PICK"
        }
      ],
      "gives": [
        {
          "name": "Daniel Jones",
          "position": "QB",
          "team": "IND",
          "age": 28,
          "careerStage": "Entering Prime"
        },
        {
          "name": "2026 Round 2 pick",
          "position": "PICK"
        }
      ]
    }
  ],
  "draftPicks": [
    {
      "season": "2026",
      "round": 2,
      "from": "powerperson",
      "to": "PrinceofPizza"
    },
    {
      "season": "2027",
      "round": 1,
      "from": "PrinceofPizza",
      "to": "powerperson"
    }
  ],
  "persona": "Todd McShay",
  "analysis": "Look, when you break down this trade, you've got \"The Win-Now Warrior\" in PrinceofPizza making a classic contender's move, going all-in on immediate production while mortgaging future draft capital. And on the other side, you've got \"The Patient Architect\" in powerperson doing exactly what a bottom-dweller should be doing—stockpiling premium picks and playing the long game. This is textbook roster construction from both sides based on their competitive windows.\n\nLet's talk value here. PrinceofPizza is essentially buying a starting quarterback AND a 2026 second-rounder for a 2027 first. That's tremendous value if you're competing right now. Daniel Jones has improved his output by 6.5 points per game post-trade—that's not noise, that's a legitimate QB2 with upside in Indianapolis' system. For a team ranked third with an 80.8 power score, this is the classic \"best player available for your contention window\" move. They identified quarterback as a position of need, and they didn't reach—they got their guy at a reasonable price while keeping their core intact. The +2.5 power score bump tells you everything you need to know about the immediate impact. This fills a hole without sacrificing the foundation.\n\nBut here's where it gets interesting for powerperson. They're sitting at 23.8 power score—they're not competing anytime soon, folks. Moving a 28-year-old quarterback who's entering his prime might seem counterintuitive, but this is smart team-building. They're converting a depreciating asset into premium draft capital. A 2027 first-rounder from a team that's burning picks to win now? That could be a top-three selection if PrinceofPizza's window closes. Yes, they're giving up the 2026 second, but when you're rebuilding, you consolidate picks and aim for the home run swings. This is value extraction at its finest—they weren't winning with Jones anyway, so why not get maximum return?\n\nHere's my bold prediction: In two years, this trade looks like a STEAL for powerperson. By 2027, PrinceofPizza's aging core has declined, that first-rounder becomes a top-five pick, and The Patient Architect drafts a franchise cornerstone. Meanwhile, Daniel Jones will have provided one solid playoff push before his value craters. The risk profile? Minimal for the rebuilder—they're playing with house money. For the contender, it's higher stakes—if they don't cash in with a championship in the next two seasons, they've sacrificed long-term equity for a rental. But that's the price of contention, and when you're ranked third in power score, you've got to strike while the iron's hot.",
  "generatedAt": "2025-12-28T21:26:16.700Z"
}