{
  "tradeId": "1c13892ad13a168e",
  "week": 1,
  "season": "2025",
  "leagueId": "1182940167115010048",
  "participants": [
    "Shogunation",
    "Tishathefish"
  ],
  "sides": [
    {
      "teamName": "Shogunation",
      "teamContext": "Strong contender - win-now mode",
      "powerScore": {
        "powerScore": 76.4,
        "powerRank": 4,
        "lineupValueScore": 79,
        "performanceScore": 78.2,
        "positionalScore": 62.7,
        "depthScore": 80.9,
        "totalTeams": 12,
        "totalRosterValue": 37890
      },
      "tradeImpact": {
        "valueGained": 370,
        "valueLost": 64,
        "netValueChange": 306,
        "estimatedPowerScoreChange": 0.3,
        "playersGained": [
          {
            "name": "Dallas Goedert",
            "value": 370
          }
        ],
        "playersLost": [
          {
            "name": "Pat Freiermuth",
            "value": 64
          }
        ]
      },
      "receives": [
        {
          "name": "Dallas Goedert",
          "position": "TE",
          "team": "PHI",
          "age": 30,
          "careerStage": "Prime Years"
        }
      ],
      "gives": [
        {
          "name": "Pat Freiermuth",
          "position": "TE",
          "team": "PIT",
          "age": 26,
          "careerStage": "Entering Prime"
        },
        {
          "name": "Khalil Herbert",
          "position": "RB",
          "team": "NYJ",
          "age": 27,
          "careerStage": "Prime Years"
        }
      ]
    },
    {
      "teamName": "Tishathefish",
      "teamContext": "Rebuilding - future-focused",
      "powerScore": {
        "powerScore": 50,
        "powerRank": 7,
        "lineupValueScore": 60.7,
        "performanceScore": 36.4,
        "positionalScore": 47.1,
        "depthScore": 33.9,
        "totalTeams": 12,
        "totalRosterValue": 29125
      },
      "tradeImpact": {
        "valueGained": 64,
        "valueLost": 370,
        "netValueChange": -306,
        "estimatedPowerScoreChange": -0.3,
        "playersGained": [
          {
            "name": "Pat Freiermuth",
            "value": 64
          }
        ],
        "playersLost": [
          {
            "name": "Dallas Goedert",
            "value": 370
          }
        ]
      },
      "receives": [
        {
          "name": "Pat Freiermuth",
          "position": "TE",
          "team": "PIT",
          "age": 26,
          "careerStage": "Entering Prime"
        },
        {
          "name": "Khalil Herbert",
          "position": "RB",
          "team": "NYJ",
          "age": 27,
          "careerStage": "Prime Years"
        }
      ],
      "gives": [
        {
          "name": "Dallas Goedert",
          "position": "TE",
          "team": "PHI",
          "age": 30,
          "careerStage": "Prime Years"
        }
      ]
    }
  ],
  "draftPicks": [],
  "persona": "Todd McShay",
  "analysis": "Look, when I see a trade like this, I immediately think about team-building philosophy and roster construction—and what we've got here is a classic case of \"The Window Shopper\" in Shogunation taking advantage of \"The Liquidator\" over at Tishathefish. This is tremendous value for a win-now squad getting younger at a premium position while the other side is essentially waving the white flag.\n\nLet me break down what just happened here. Shogunation—sitting at a power score of 76.4, good for 4th in this league—just pulled off an absolute steal. They're giving up Pat Freiermuth and Khalil Herbert, getting back Dallas Goedert, and somehow winning this trade by a net value of 306 points according to the metrics. Now, I know what you're thinking: \"Todd, Goedert is 30 years old, how is this a win?\" Here's the thing—when you're a contender, you need to maximize your championship window. Goedert has been more productive (5.7 PPG versus 5.6 for Freiermuth), and while he's only got about two peak years left, that's exactly what a team ranked 4th needs. They're not rebuilding; they're going for it NOW. Freiermuth might be four years younger, but potential doesn't win you championships—production does. And throwing in Herbert, who's a backup running back at this stage of his career? That's addition by subtraction for a team that needs to consolidate depth into starting quality.\n\nNow let's talk about Tishathefish, because this is where the trade gets concerning from a roster construction standpoint. They're sitting at 50 power score, ranked 7th out of 12, with particularly weak depth (33.9 depth component—that's bottom-tier). Their trading history shows they're generally balanced, but this move? This screams desperation or complete misread of their competitive timeline. You're giving up the better fantasy producer at tight end, a guy who's proven he can be a TE1 in this league, for a younger tight end who's shown flashes but hasn't fully broken out, plus a backup running back who just changed teams to the Jets. If you're rebuilding, I get it—but the value just isn't there. You need draft capital, you need young assets with upside, not marginal pieces. This feels like they're trying to get younger without actually committing to a rebuild, and that's how you end up stuck in no-man's land for years.\n\nThe timing here is absolutely critical, and frankly, Shogunation nailed it while Tishathefish missed the boat. Week 1, early season, 13 weeks until playoffs—this is when contenders should be consolidating assets and making their championship push. Shogunation's history shows they're an active trader who typically moves more players out than in (14 traded away versus 10 acquired all-time), but when they make a move, it's calculated. This fits their pattern of selling depth pieces to upgrade starters. For a team with championship aspirations—and make no mistake, a 76.4 power score puts you in the hunt—you make this deal ten times out of ten. You're betting on two years of Goedert's peak production to deliver you a title. Meanwhile, Tishathefish should've been shopping Goedert for draft capital and true rebuilding pieces, not lateral moves that make you slightly younger but significantly worse. This is the difference between teams that understand their competitive window and teams that are just making moves to make moves. Best player available? Shogunation got him. Value pick? Absolute highway robbery. Championship implications? Shogunation just increased their title odds while Tishathefish is looking at another season of mediocrity.",
  "generatedAt": "2025-12-29T01:35:35.554Z"
}