{
  "tradeId": "b35d4bc4d4c2a325",
  "week": 10,
  "season": "2023",
  "leagueId": "1182940167115010048",
  "participants": [
    "drobs",
    "cosmohouck"
  ],
  "sides": [
    {
      "teamName": "drobs",
      "teamContext": "Playoff contender - competitive",
      "powerScore": {
        "powerScore": 51.3,
        "powerRank": 6,
        "lineupValueScore": 53.3,
        "performanceScore": 57.3,
        "positionalScore": 36.8,
        "depthScore": 38,
        "totalTeams": 12,
        "totalRosterValue": 25560
      },
      "tradeImpact": {
        "valueGained": 0,
        "valueLost": 380,
        "netValueChange": -380,
        "estimatedPowerScoreChange": -0.4,
        "playersGained": [],
        "playersLost": [
          {
            "name": "Rashid Shaheed",
            "value": 380
          }
        ]
      },
      "receives": [
        {
          "name": "Cole Kmet",
          "position": "TE",
          "team": "CHI",
          "age": 26,
          "careerStage": "Entering Prime"
        }
      ],
      "gives": [
        {
          "name": "Rashid Shaheed",
          "position": "WR",
          "team": "NO",
          "age": 27,
          "careerStage": "Prime Years"
        },
        {
          "name": "2026 Round 3 pick",
          "position": "PICK"
        }
      ]
    },
    {
      "teamName": "cosmohouck",
      "teamContext": "Strong contender - win-now mode",
      "powerScore": {
        "powerScore": 93.4,
        "powerRank": 1,
        "lineupValueScore": 100,
        "performanceScore": 80.6,
        "positionalScore": 94.6,
        "depthScore": 100,
        "totalTeams": 12,
        "totalRosterValue": 47988
      },
      "tradeImpact": {
        "valueGained": 380,
        "valueLost": 0,
        "netValueChange": 380,
        "estimatedPowerScoreChange": 0.4,
        "playersGained": [
          {
            "name": "Rashid Shaheed",
            "value": 380
          }
        ],
        "playersLost": []
      },
      "receives": [
        {
          "name": "Rashid Shaheed",
          "position": "WR",
          "team": "NO",
          "age": 27,
          "careerStage": "Prime Years"
        },
        {
          "name": "2026 Round 3 pick",
          "position": "PICK"
        }
      ],
      "gives": [
        {
          "name": "Cole Kmet",
          "position": "TE",
          "team": "CHI",
          "age": 26,
          "careerStage": "Entering Prime"
        }
      ]
    }
  ],
  "draftPicks": [
    {
      "season": "2026",
      "round": 3,
      "from": "drobs",
      "to": "cosmohouck"
    }
  ],
  "persona": "Mel Kiper Jr.",
  "analysis": "Look, I've been doing this for over four decades, and let me tell you something - this trade RIGHT HERE is a classic case of a contender making a WIN-NOW move, and I'm not sure drobs understands what they just gave up! This reminds me of when the Cowboys traded Herschel Walker to Minnesota - one team getting a haul while the other thinks they're plugging a hole. Cosmohouck is sitting pretty at #1 with a power score of 93.4, and they just fleeced the #6 team for additional depth AND a draft pick!\n\nNow, let me break down Cole Kmet for you - and I've had my eye on this kid since his days at Notre Dame. This is a guy who was the Fighting Irish's top receiving threat, a former BASKETBALL PLAYER with elite athleticism and catch radius. But here's the thing: tight end is THE most volatile fantasy position, and while the position scarcity says he's \"elite premium,\" the tape tells a different story when he's averaging 7.8 points per game pre-trade and dropping to 5.8 post-trade! That's a TWO-POINT decline, folks! Meanwhile, Rashid Shaheed - an undrafted FREE AGENT out of Weber State who I had circled on my small-school prospects board - he's a burner with 4.3 speed who can take the top off ANY defense. Yes, his production dropped post-trade, but drobs is paying a THIRD-ROUND PICK on top of giving up a prime-aged speed demon for marginal tight end production!\n\nThis trade happened Week 10, right when playoff positioning starts crystallizing, and drobs needed to make a move - I get it. But trading WITH the #1 team in your league? That's like the Colts helping the Patriots! The power score impact tells you everything: drobs LOSES 0.4 while cosmohouck GAINS 0.4 - that's a 0.8 swing! You're essentially helping the rich get richer. Cosmohouck added a 380-value asset package for ZERO - that's highway robbery! The #1 team just got deeper, got younger at receiver, and picked up draft capital while dumping a tight end in decline. This wasn't a trade, this was a DONATION!",
  "generatedAt": "2025-12-28T21:41:02.370Z"
}