{
  "tradeId": "38fa903a18a73297",
  "week": 3,
  "season": "2022",
  "leagueId": "1182940167115010048",
  "participants": [
    "mastab24",
    "Shogunation"
  ],
  "sides": [
    {
      "teamName": "Shogunation",
      "teamContext": "Strong contender - win-now mode",
      "powerScore": {
        "powerScore": 76.4,
        "powerRank": 4,
        "lineupValueScore": 79,
        "performanceScore": 78.2,
        "positionalScore": 62.7,
        "depthScore": 80.9,
        "totalTeams": 12,
        "totalRosterValue": 37890
      },
      "tradeImpact": {
        "valueGained": 3751,
        "valueLost": 2917,
        "netValueChange": 834,
        "estimatedPowerScoreChange": 0.9,
        "playersGained": [
          {
            "name": "Dak Prescott",
            "value": 3751
          }
        ],
        "playersLost": [
          {
            "name": "Jared Goff",
            "value": 2917
          }
        ]
      },
      "receives": [
        {
          "name": "Dak Prescott",
          "position": "QB",
          "team": "DAL",
          "age": 32,
          "careerStage": "Prime Years"
        }
      ],
      "gives": [
        {
          "name": "Jared Goff",
          "position": "QB",
          "team": "DET",
          "age": 30,
          "careerStage": "Prime Years"
        }
      ]
    },
    {
      "teamName": "mastab24",
      "teamContext": "Strong contender - win-now mode",
      "powerScore": {
        "powerScore": 64.6,
        "powerRank": 5,
        "lineupValueScore": 70,
        "performanceScore": 68.3,
        "positionalScore": 52.1,
        "depthScore": 26.7,
        "totalTeams": 12,
        "totalRosterValue": 33582
      },
      "tradeImpact": {
        "valueGained": 2917,
        "valueLost": 3751,
        "netValueChange": -834,
        "estimatedPowerScoreChange": -0.9,
        "playersGained": [
          {
            "name": "Jared Goff",
            "value": 2917
          }
        ],
        "playersLost": [
          {
            "name": "Dak Prescott",
            "value": 3751
          }
        ]
      },
      "receives": [
        {
          "name": "Jared Goff",
          "position": "QB",
          "team": "DET",
          "age": 30,
          "careerStage": "Prime Years"
        }
      ],
      "gives": [
        {
          "name": "Dak Prescott",
          "position": "QB",
          "team": "DAL",
          "age": 32,
          "careerStage": "Prime Years"
        }
      ]
    }
  ],
  "draftPicks": [],
  "persona": "Todd McShay",
  "analysis": "Look, I've been doing this a long time, and when I see a trade like this go down in Week 3, my first instinct is to pump the brakes and ask: what are we really evaluating here? Because right now, mastab24 – let's call him \"The Panic Button\" – is sitting at 0-2, watching Dak Prescott put up a ghastly 1.5 points per game through three weeks, and he's making a desperation move based on three-game sample size. Meanwhile, Shogunation – \"The Opportunist\" – is 2-0, sitting pretty at 76.4 power score, and he's buying low on a franchise quarterback who was a first-round pick just months ago. This is classic vulture behavior, and I love the value play here.\n\nFrom a pure roster construction standpoint, The Opportunist is getting tremendous value. We're talking about an 834-point dynasty value swing in his favor. Dak Prescott is the better long-term asset – there's no debate there. Yes, Goff has outperformed him through three weeks, but let's be real: that's noise, not signal. Dak has CeeDee Lamb, a top-tier offensive line when healthy, and he's in the better offensive scheme. The Opportunist doesn't need immediate production – he's already winning games. He can afford to stash Dak through whatever early-season struggles we're seeing and reap the rewards when Dallas figures it out. This is best player available mentality in a trade format. You don't reach for the hot hand in September; you take the cornerstone piece and build around it.\n\nNow, The Panic Button? I get why he's doing this – he's 0-2, desperately needs wins NOW, and Goff has been cooking through three weeks. But here's my concern: you're selling premium draft capital essentially because you're chasing points in Week 3. That's how rebuilding teams stay mediocre. His power score is already sitting at just 64.6, ranked fifth, and his depth is an abysmal 26.7. He doesn't have the runway to be trading away the more valuable asset for short-term production. Even if Goff outscores Dak ROS 2022 – which is possible given Detroit's pass volume – you're losing this trade in dynasty format every single time. The age difference is negligible, but the talent gap and situation in Dallas versus Detroit? That matters for years two, three, four of this equation.\n\nHere's my bold prediction: two years from now, we look back at this as a franchise-altering heist. The Opportunist will have ridden Dak to at least one championship appearance while The Panic Button is still scrambling to find consistency at the quarterback position, having moved Goff again for pennies on the dollar. Championship implications? Shogunation just increased their title odds significantly. They addressed a position by upgrading the long-term asset while they're already winning games. That's how contenders operate. Mastab24 might squeak into the playoffs this year if Goff stays hot, but they just mortgaged their future for a rental mentality, and in dynasty, that's how you end up perpetually picking in the middle of the draft with no path to true contention. This is a steal for Shogunation – tremendous value for a team that's already built to win now and later.",
  "generatedAt": "2025-12-29T01:57:02.179Z"
}