{
  "tradeId": "89f18b91a30a5407",
  "week": 1,
  "season": "2023",
  "leagueId": "1182940167115010048",
  "participants": [
    "Shogunation",
    "powerperson"
  ],
  "sides": [
    {
      "teamName": "Shogunation",
      "teamContext": "Strong contender - win-now mode",
      "powerScore": {
        "powerScore": 76.4,
        "powerRank": 4,
        "lineupValueScore": 79,
        "performanceScore": 78.2,
        "positionalScore": 62.7,
        "depthScore": 80.9,
        "totalTeams": 12,
        "totalRosterValue": 37890
      },
      "tradeImpact": {
        "valueGained": 1703,
        "valueLost": 495,
        "netValueChange": 1208,
        "estimatedPowerScoreChange": 1.3,
        "playersGained": [
          {
            "name": "Davante Adams",
            "value": 1703
          }
        ],
        "playersLost": [
          {
            "name": "Chris Godwin",
            "value": 495
          }
        ]
      },
      "receives": [
        {
          "name": "Davante Adams",
          "position": "WR",
          "team": "LAR",
          "age": 32,
          "careerStage": "Declining"
        }
      ],
      "gives": [
        {
          "name": "Chris Godwin",
          "position": "WR",
          "team": "TB",
          "age": 29,
          "careerStage": "Prime Years"
        },
        {
          "name": "2025 Round 2 pick",
          "position": "PICK"
        }
      ]
    },
    {
      "teamName": "powerperson",
      "teamContext": "Rebuilding - future-focused",
      "powerScore": {
        "powerScore": 23.8,
        "powerRank": 11,
        "lineupValueScore": 26.4,
        "performanceScore": 21.6,
        "positionalScore": 20.9,
        "depthScore": 19.1,
        "totalTeams": 12,
        "totalRosterValue": 12690
      },
      "tradeImpact": {
        "valueGained": 495,
        "valueLost": 1703,
        "netValueChange": -1208,
        "estimatedPowerScoreChange": -1.3,
        "playersGained": [
          {
            "name": "Chris Godwin",
            "value": 495
          }
        ],
        "playersLost": [
          {
            "name": "Davante Adams",
            "value": 1703
          }
        ]
      },
      "receives": [
        {
          "name": "Chris Godwin",
          "position": "WR",
          "team": "TB",
          "age": 29,
          "careerStage": "Prime Years"
        },
        {
          "name": "2025 Round 2 pick",
          "position": "PICK"
        }
      ],
      "gives": [
        {
          "name": "Davante Adams",
          "position": "WR",
          "team": "LAR",
          "age": 32,
          "careerStage": "Declining"
        }
      ]
    }
  ],
  "draftPicks": [
    {
      "season": "2025",
      "round": 2,
      "from": "Shogunation",
      "to": "powerperson"
    }
  ],
  "persona": "Louis Riddick",
  "analysis": "From a front office standpoint, this is a fascinating case study in organizational philosophy and what I call \"championship window asset management.\" You've got Shogunation sitting at a respectable Power Score of 76.4, ranked fourth in a twelve-team league, and they're making a Week 1 move that tells you everything about their intentions. They're saying \"we're going for it NOW.\" Trading away a 2025 second-round pick and Chris Godwin to acquire Davante Adams? That's the fantasy football equivalent of the Rams trading for Jalen Ramsey in 2019. You're mortgaging tomorrow to maximize today, and when you're a contender, that's exactly what you should be doing. The problem is, they acquired Adams when he was 32 years old with 11 years of tread on those tires, and he was averaging 15.5 points per game at that moment. But here's what concerns me: post-trade, Adams fell off to 11.4 PPG—a 4.2-point drop. That's not just regression, that's a cliff. Meanwhile, Godwin only dropped 2.4 points per game. That's a significant miscalculation in player evaluation.\n\nNow let's talk about powerperson for a moment, because this is where the trade gets really interesting from a strategic standpoint. They're sitting at a Power Score of 23.8, ranked eleventh out of twelve teams. They're in full rebuild mode, and they executed this deal with precision. They moved an aging asset in Adams—whose declining career stage was predictable given his age and mileage—and they acquired a younger player still in his prime years PLUS draft capital. That 2025 second-round pick is gold for a rebuilding team. This is textbook asset accumulation when you're not competing. You're essentially selling high on name value and acquiring pieces that fit your timeline. The fact that Adams significantly underperformed post-trade while Godwin held more consistent value? That's the cherry on top for powerperson.\n\nHere's my bold prediction: two years from now, in 2025, we're going to look back at this trade and it's going to be a cautionary tale about chasing names over production curves. Adams will likely be out of fantasy relevance by then, while Godwin—assuming health—could still be a WR2/3 option, and that second-round pick will have turned into a valuable young asset for powerperson's rebuilt roster. Shogunation thought they were getting that final piece for a championship run, but they actually accelerated their own decline by sacrificing future flexibility for a depreciating asset. From a talent evaluation standpoint, they missed on the aging curve, plain and simple.\n\n**The Verdict:** Powerperson wins this trade, and it's not particularly close. They displayed superior asset management by recognizing their competitive window was closed and maximizing return on a declining veteran. Shogunation? They made the classic win-now team mistake—overpaying for the name on the back of the jersey instead of projecting the production curve. That +1.3 Power Score bump they expected? It evaporated when Adams' performance cratered by 4.2 points per game. In the NFL, we see this all the time—teams trading for aging stars who can't deliver. This is dynasty fantasy football, where you've got to think like a GM building for sustained success, not just one season. Shogunation thought they were the Rams going all-in. Instead, they became the team that bought high and sold low on their own championship window.",
  "generatedAt": "2025-12-28T21:35:35.358Z"
}