{
  "tradeId": "a0f9057574b7f3bd",
  "week": 9,
  "season": "2023",
  "leagueId": "1182940167115010048",
  "participants": [
    "drobs",
    "powerperson"
  ],
  "sides": [
    {
      "teamName": "drobs",
      "teamContext": "Playoff contender - competitive",
      "powerScore": {
        "powerScore": 51.3,
        "powerRank": 6,
        "lineupValueScore": 53.3,
        "performanceScore": 57.3,
        "positionalScore": 36.8,
        "depthScore": 38,
        "totalTeams": 12,
        "totalRosterValue": 25560
      },
      "tradeImpact": {
        "valueGained": 495,
        "valueLost": 0,
        "netValueChange": 495,
        "estimatedPowerScoreChange": 0.5,
        "playersGained": [
          {
            "name": "Chris Godwin",
            "value": 495
          }
        ],
        "playersLost": []
      },
      "receives": [
        {
          "name": "Chris Godwin",
          "position": "WR",
          "team": "TB",
          "age": 29,
          "careerStage": "Prime Years"
        }
      ],
      "gives": [
        {
          "name": "Kadarius Toney",
          "position": "WR",
          "team": "FA",
          "age": 25,
          "careerStage": "Entering Prime"
        },
        {
          "name": "2026 Round 2 pick",
          "position": "PICK"
        }
      ]
    },
    {
      "teamName": "powerperson",
      "teamContext": "Rebuilding - future-focused",
      "powerScore": {
        "powerScore": 23.8,
        "powerRank": 11,
        "lineupValueScore": 26.4,
        "performanceScore": 21.6,
        "positionalScore": 20.9,
        "depthScore": 19.1,
        "totalTeams": 12,
        "totalRosterValue": 12690
      },
      "tradeImpact": {
        "valueGained": 0,
        "valueLost": 495,
        "netValueChange": -495,
        "estimatedPowerScoreChange": -0.5,
        "playersGained": [],
        "playersLost": [
          {
            "name": "Chris Godwin",
            "value": 495
          }
        ]
      },
      "receives": [
        {
          "name": "Kadarius Toney",
          "position": "WR",
          "team": "FA",
          "age": 25,
          "careerStage": "Entering Prime"
        },
        {
          "name": "2026 Round 2 pick",
          "position": "PICK"
        }
      ],
      "gives": [
        {
          "name": "Chris Godwin",
          "position": "WR",
          "team": "TB",
          "age": 29,
          "careerStage": "Prime Years"
        }
      ]
    }
  ],
  "draftPicks": [
    {
      "season": "2026",
      "round": 2,
      "from": "drobs",
      "to": "powerperson"
    }
  ],
  "persona": "Todd McShay",
  "analysis": "Look, I've been evaluating talent and team-building strategies for two decades, and this is one of those trades where the value disparity is so glaring that you have to question what's really going on here. Drobs is getting Chris Godwin – a proven, productive NFL receiver who's putting up 9.1 fantasy points per game – while essentially giving up a flier in Kadarius Toney and a 2026 second-rounder. This is highway robbery disguised as a trade. We're talking about a playoff contender at 5-3, sitting at 51.3 power score, adding immediate firepower to their receiving corps while the 11th-ranked team in a 12-team league is waving the white flag on their season. This isn't roster construction; this is asset liquidation, and frankly, I don't love the return for powerperson.\n\nHere's my bold prediction: In two years, we'll look back at this trade the same way we view the Tyreek Hill deal – except in reverse. When Kansas City sent Hill to Miami for those multiple first-rounders, everyone thought the Dolphins mortgaged their future for one player. But the Chiefs got tremendous draft capital to rebuild and retool. Powerperson *should* be playing that Chiefs role here – they're 1-7, clearly eliminated from playoff contention, and need to accumulate assets for the future. But a 2026 second-rounder for a 29-year-old receiver entering the back nine of his career? That's not enough draft capital. This trade will haunt powerperson when Godwin helps drobs make a legitimate playoff run this year while they're left holding Kadarius Toney – who's averaging under 3 points per game and is currently a free agent – and a mid-round pick two years from now.\n\nLet's talk about fit and team needs. Drobs has been an active trader all season – this is their fifth deal – and they're showing a clear win-now mentality. They've acquired 18 players historically while only moving 16, which tells me they're buyers, not sellers. This absolutely fits their pattern of aggressive team-building. At 5-3 with five weeks until playoffs, they've identified a position of need and they're attacking it. That's smart roster construction when you're a legitimate contender. Meanwhile, powerperson is also an active trader with six deals this season, but here's where I question their strategy: if you're 1-7 with a 23.8 power score, you need to be accumulating premium draft capital, not taking fliers on damaged goods like Toney. This is a value pick gone wrong – they should be demanding a 2025 first-rounder or multiple Day 2 picks, not settling for a 2026 second.\n\nChampionship implications? This moves the needle significantly for drobs. They're already ranked 6th in power score, and this trade projects to add another half-point. More importantly, they're adding a player who can contribute immediately to a roster that's already scoring nearly 1,000 points through eight weeks. That's best player available meeting immediate team need. For powerperson, this is throwing in the towel on 2023 – which is fine – but you need better return on investment when you're trading away your productive assets. The net value here is negative 495 points for them, which is brutal any way you slice it. Bottom line: drobs just got tremendous value and improved their championship odds, while powerperson is reaching for lottery tickets when they should be building a war chest of picks. This is how contenders separate themselves from pretenders in dynasty leagues.",
  "generatedAt": "2025-12-29T01:54:59.228Z"
}