{
  "tradeId": "e2de86cfcf5a619c",
  "week": 8,
  "season": "2022",
  "leagueId": "1182940167115010048",
  "participants": [
    "drobs",
    "cosmohouck"
  ],
  "sides": [
    {
      "teamName": "drobs",
      "teamContext": "Playoff contender - competitive",
      "powerScore": {
        "powerScore": 51.3,
        "powerRank": 6,
        "lineupValueScore": 53.3,
        "performanceScore": 57.3,
        "positionalScore": 36.8,
        "depthScore": 38,
        "totalTeams": 12,
        "totalRosterValue": 25560
      },
      "tradeImpact": {
        "valueGained": 326,
        "valueLost": 0,
        "netValueChange": 326,
        "estimatedPowerScoreChange": 0.3,
        "playersGained": [
          {
            "name": "Isaiah Likely",
            "value": 326
          }
        ],
        "playersLost": []
      },
      "receives": [
        {
          "name": "Raheem Mostert",
          "position": "RB",
          "team": "LV",
          "age": 33,
          "careerStage": "Veteran/End of Career"
        },
        {
          "name": "Kadarius Toney",
          "position": "WR",
          "team": "FA",
          "age": 25,
          "careerStage": "Entering Prime"
        },
        {
          "name": "Isaiah Likely",
          "position": "TE",
          "team": "BAL",
          "age": 25,
          "careerStage": "Entering Prime"
        },
        {
          "name": "2024 Round 2 pick",
          "position": "PICK"
        },
        {
          "name": "2024 Round 3 pick",
          "position": "PICK"
        },
        {
          "name": "2023 Round 2 pick",
          "position": "PICK"
        }
      ],
      "gives": [
        {
          "name": "Hayden Hurst",
          "position": "TE",
          "team": "FA",
          "age": 31,
          "careerStage": "Prime Years"
        },
        {
          "name": "Jahan Dotson",
          "position": "WR",
          "team": "PHI",
          "age": 25,
          "careerStage": "Entering Prime"
        },
        {
          "name": "Bailey Zappe",
          "position": "QB",
          "team": "CLE",
          "age": 26,
          "careerStage": "Entering Prime"
        },
        {
          "name": "2023 Round 1 pick",
          "position": "PICK"
        }
      ]
    },
    {
      "teamName": "cosmohouck",
      "teamContext": "Strong contender - win-now mode",
      "powerScore": {
        "powerScore": 93.4,
        "powerRank": 1,
        "lineupValueScore": 100,
        "performanceScore": 80.6,
        "positionalScore": 94.6,
        "depthScore": 100,
        "totalTeams": 12,
        "totalRosterValue": 47988
      },
      "tradeImpact": {
        "valueGained": 0,
        "valueLost": 326,
        "netValueChange": -326,
        "estimatedPowerScoreChange": -0.3,
        "playersGained": [],
        "playersLost": [
          {
            "name": "Isaiah Likely",
            "value": 326
          }
        ]
      },
      "receives": [
        {
          "name": "Hayden Hurst",
          "position": "TE",
          "team": "FA",
          "age": 31,
          "careerStage": "Prime Years"
        },
        {
          "name": "Jahan Dotson",
          "position": "WR",
          "team": "PHI",
          "age": 25,
          "careerStage": "Entering Prime"
        },
        {
          "name": "Bailey Zappe",
          "position": "QB",
          "team": "CLE",
          "age": 26,
          "careerStage": "Entering Prime"
        },
        {
          "name": "2023 Round 1 pick",
          "position": "PICK"
        }
      ],
      "gives": [
        {
          "name": "Raheem Mostert",
          "position": "RB",
          "team": "LV",
          "age": 33,
          "careerStage": "Veteran/End of Career"
        },
        {
          "name": "Kadarius Toney",
          "position": "WR",
          "team": "FA",
          "age": 25,
          "careerStage": "Entering Prime"
        },
        {
          "name": "Isaiah Likely",
          "position": "TE",
          "team": "BAL",
          "age": 25,
          "careerStage": "Entering Prime"
        },
        {
          "name": "2024 Round 2 pick",
          "position": "PICK"
        },
        {
          "name": "2024 Round 3 pick",
          "position": "PICK"
        },
        {
          "name": "2023 Round 2 pick",
          "position": "PICK"
        }
      ]
    }
  ],
  "draftPicks": [
    {
      "season": "2023",
      "round": 1,
      "from": "drobs",
      "to": "cosmohouck"
    },
    {
      "season": "2024",
      "round": 2,
      "from": "cosmohouck",
      "to": "drobs"
    },
    {
      "season": "2024",
      "round": 3,
      "from": "cosmohouck",
      "to": "drobs"
    },
    {
      "season": "2023",
      "round": 2,
      "from": "cosmohouck",
      "to": "drobs"
    }
  ],
  "persona": "Todd McShay",
  "analysis": "Look, when I first saw this deal come across my desk, I had to do a double-take. This is what we call a classic \"pick acquisition play\" – and cosmohouck is absolutely robbing drobs blind here. Let me be crystal clear: cosmohouck wins this trade, and it's not even close. They're at 1-6, sitting on the league's best power score at 93.4, and they've clearly pivoted to full rebuild mode. This manager has been stockpiling draft capital like they're running an NFL war room – eight picks acquired this season alone – and this move nets them a 2023 first-rounder while only giving up three rotation pieces and some mid-round picks. That's tremendous value for a team that's already eliminated from playoff contention. Meanwhile, drobs is sitting at 3-4, on the bubble, and just mortgaged significant future capital for... Raheem Mostert at age 33? Isaiah Likely averaging 4 points per game? This screams desperation, not strategic roster construction.\n\nHere's where this gets interesting from a team-building perspective: drobs is the \"balanced\" trader making their fifth move, but this doesn't look balanced at all – this looks panicked. You're giving up Jahan Dotson, who's 25 and entering his prime, for a running back who's likely got maybe six productive games left in him, max. Dotson was drafted in the 11th round and showed flashes of being a steal at that value; Mostert is pure win-now rental material. And let's talk about that draft capital exchange – you're giving up a 2023 first-rounder to GET back second and third-rounders? That's not how you accumulate value in dynasty formats. Best player available matters, and right now, cosmohouck is positioning themselves to grab multiple high-value rookies while drobs is chasing a playoff berth that their 51.3 power score (ranked 6th) suggests they probably won't secure anyway.\n\nThis trade reminds me of the Tyreek Hill deal where Kansas City moved an elite asset for a haul of draft capital – except in this case, the \"elite asset\" is actually a collection of aging vets and dart throws. Cosmohouck is playing the Chiefs' role here, trading away immediate production for long-term value, but they're getting a better return because drobs overvalued what they were receiving. The data doesn't lie: drobs is receiving 326 in dynasty value while giving up assets with unclear or declining value trajectories. Isaiah Likely might be \"rising,\" but he's buried on Baltimore's depth chart and hasn't proven he can be a consistent fantasy contributor. Meanwhile, cosmohouck just added a first-round pick – the most valuable commodity in dynasty leagues – while dumping players they weren't going to use in their rebuild anyway.\n\nHere's my bold prediction: In two years, we'll look back at this as the trade that defined both franchises' trajectories. Cosmohouck is going to hit on at least two of those picks they've accumulated – probably landing a stud RB1 with that 2023 first – and become a dynasty powerhouse by 2024. Drobs? They'll miss the playoffs in 2022, watch Mostert retire, and realize they gave away genuine young talent in Dotson for a failed playoff push. This is the difference between understanding positional value and reaching for need. Cosmohouck identified their window was closed, sold high on depreciating assets, and acquired the draft capital to properly rebuild. That's championship-level roster construction. Drobs just made a panic move that doesn't fit their timeline, doesn't address their real weaknesses, and mortgaged the future for a present that isn't championship-caliber. In my evaluation, this isn't even close – cosmohouck gets an A+, drobs gets a D, and we'll be talking about this one for years.",
  "generatedAt": "2025-12-29T02:01:16.605Z"
}