{
  "tradeId": "e0ba83b7f5926ea2",
  "week": 7,
  "season": "2025",
  "leagueId": "1235581944008286208",
  "participants": [
    "BigBishAl76",
    "NiallCarslaw"
  ],
  "sides": [
    {
      "teamName": "BigBishAl76",
      "teamContext": "Strong contender - win-now mode",
      "powerScore": {
        "powerScore": 60.4,
        "powerRank": 2,
        "lineupValueScore": 53.3,
        "performanceScore": 72.6,
        "positionalScore": 75.6,
        "depthScore": 12.2,
        "totalTeams": 16,
        "totalRosterValue": 32028
      },
      "tradeImpact": {
        "valueGained": 448,
        "valueLost": 1127,
        "netValueChange": -679,
        "estimatedPowerScoreChange": -0.6,
        "playersGained": [
          {
            "name": "T.J. Hockenson",
            "value": 386
          },
          {
            "name": "Sean Tucker",
            "value": 62
          }
        ],
        "playersLost": [
          {
            "name": "David Montgomery",
            "value": 903
          },
          {
            "name": "Parker Washington",
            "value": 224
          }
        ]
      },
      "receives": [
        {
          "name": "T.J. Hockenson",
          "position": "TE",
          "team": "MIN",
          "age": 28,
          "careerStage": "Prime Years"
        },
        {
          "name": "Sean Tucker",
          "position": "RB",
          "team": "TB",
          "age": 24,
          "careerStage": "Entering Prime"
        },
        {
          "name": "Luke McCaffrey",
          "position": "WR",
          "team": "WAS",
          "age": 24,
          "careerStage": "Entering Prime"
        }
      ],
      "gives": [
        {
          "name": "David Montgomery",
          "position": "RB",
          "team": "DET",
          "age": 28,
          "careerStage": "Prime Years"
        },
        {
          "name": "Parker Washington",
          "position": "WR",
          "team": "JAX",
          "age": 23,
          "careerStage": "Entering Prime"
        }
      ]
    },
    {
      "teamName": "NiallCarslaw",
      "teamContext": "Middle of pack - unclear direction",
      "powerScore": {
        "powerScore": 45.9,
        "powerRank": 7,
        "lineupValueScore": 51,
        "performanceScore": 40.9,
        "positionalScore": 52.3,
        "depthScore": 5.8,
        "totalTeams": 16,
        "totalRosterValue": 30607
      },
      "tradeImpact": {
        "valueGained": 1127,
        "valueLost": 448,
        "netValueChange": 679,
        "estimatedPowerScoreChange": 0.6,
        "playersGained": [
          {
            "name": "David Montgomery",
            "value": 903
          },
          {
            "name": "Parker Washington",
            "value": 224
          }
        ],
        "playersLost": [
          {
            "name": "T.J. Hockenson",
            "value": 386
          },
          {
            "name": "Sean Tucker",
            "value": 62
          }
        ]
      },
      "receives": [
        {
          "name": "David Montgomery",
          "position": "RB",
          "team": "DET",
          "age": 28,
          "careerStage": "Prime Years"
        },
        {
          "name": "Parker Washington",
          "position": "WR",
          "team": "JAX",
          "age": 23,
          "careerStage": "Entering Prime"
        }
      ],
      "gives": [
        {
          "name": "T.J. Hockenson",
          "position": "TE",
          "team": "MIN",
          "age": 28,
          "careerStage": "Prime Years"
        },
        {
          "name": "Sean Tucker",
          "position": "RB",
          "team": "TB",
          "age": 24,
          "careerStage": "Entering Prime"
        },
        {
          "name": "Luke McCaffrey",
          "position": "WR",
          "team": "WAS",
          "age": 24,
          "careerStage": "Entering Prime"
        }
      ]
    }
  ],
  "draftPicks": [],
  "persona": "Roy Keane",
  "analysis": "This is an absolute shambles. What am I even looking at here? BigBishAl76 - let's call him \"The Desperate Tinkerer\" - at 3-3 and sitting at #2 in power score, and he's trading away David Montgomery, a primary starter in Detroit's powerhouse offense, for TJ Hockenson who's on the bloody PUP list with zero projected points. Zero! And two backups who won't see the field. It's madness. Pure madness. This isn't a trade, it's surrender dressed up as roster management.\n\nLook at the numbers and they tell you everything. Montgomery's averaging 11.9 points per game in one of the best offenses in football - that's gold in fantasy - and this lad's giving him away for a tight end who literally can't play right now. The value deficit is 679 points. Six hundred and seventy-nine! That's not negotiation, that's theft. And the victim is doing it to himself. NiallCarslaw - \"The Silent Assassin\" making his first trade ever and he's absolutely robbing someone blind. Fair play to him for taking advantage, but what's BigBishAl thinking? He's got playoff contender written all over him and he's dismantling his roster for players projected to score ZERO points the rest of the way. The data's screaming at him and he's not listening.\n\nThe timing couldn't be worse. Week 7, eight weeks until playoffs, and you're trading away your reliable RB2 for a player who might not even suit up this season? Montgomery's healthy, producing, and in an offense that creates endless opportunities. Hockenson's rehabbing torn ligaments with no return date. This isn't complicated stuff. You don't trade certainty for hope when you're fighting for playoff position. BigBishAl's got a history of being active - 10 trades all-time - but this one's different. This one hurts his championship chances. That -0.6 power score change might not look massive, but when you're giving away your RB depth for nothing in return, you're one injury away from disaster.\n\nChampionship implications? BigBishAl's just kissed his realistic title hopes goodbye unless he's got something spectacular cooking on his roster we can't see. You can't win championships without running backs who actually play. NiallCarslaw at 2-4 and likely eliminated has just secured a proper asset in Montgomery that he can flip again or ride if he somehow claws back into contention. The Silent Assassin played this perfectly - stayed quiet all season, then pounced when someone panicked. That's smart business. Meanwhile, The Desperate Tinkerer has traded away production for potential in a REDRAFT league where only this season matters. It's the kind of move that gets you mocked in the group chat for years. Accountability matters, and this trade shows none of it. Absolutely none.",
  "generatedAt": "2025-12-30T21:43:02.143Z"
}