{
  "tradeId": "e2bb2254dbc13602",
  "week": 1,
  "season": "2023",
  "leagueId": "1182940167115010048",
  "participants": [
    "Shogunation",
    "mastab24"
  ],
  "sides": [
    {
      "teamName": "Shogunation",
      "teamContext": "Strong contender - win-now mode",
      "powerScore": {
        "powerScore": 76.4,
        "powerRank": 4,
        "lineupValueScore": 79,
        "performanceScore": 78.2,
        "positionalScore": 62.7,
        "depthScore": 80.9,
        "totalTeams": 12,
        "totalRosterValue": 37890
      },
      "tradeImpact": {
        "valueGained": 495,
        "valueLost": 1291,
        "netValueChange": -796,
        "estimatedPowerScoreChange": -0.8,
        "playersGained": [
          {
            "name": "Chris Godwin",
            "value": 495
          }
        ],
        "playersLost": [
          {
            "name": "Courtland Sutton",
            "value": 1291
          }
        ]
      },
      "receives": [
        {
          "name": "Chris Godwin",
          "position": "WR",
          "team": "TB",
          "age": 29,
          "careerStage": "Prime Years"
        }
      ],
      "gives": [
        {
          "name": "Courtland Sutton",
          "position": "WR",
          "team": "DEN",
          "age": 30,
          "careerStage": "Prime Years"
        }
      ]
    },
    {
      "teamName": "mastab24",
      "teamContext": "Strong contender - win-now mode",
      "powerScore": {
        "powerScore": 64.6,
        "powerRank": 5,
        "lineupValueScore": 70,
        "performanceScore": 68.3,
        "positionalScore": 52.1,
        "depthScore": 26.7,
        "totalTeams": 12,
        "totalRosterValue": 33582
      },
      "tradeImpact": {
        "valueGained": 1291,
        "valueLost": 495,
        "netValueChange": 796,
        "estimatedPowerScoreChange": 0.8,
        "playersGained": [
          {
            "name": "Courtland Sutton",
            "value": 1291
          }
        ],
        "playersLost": [
          {
            "name": "Chris Godwin",
            "value": 495
          }
        ]
      },
      "receives": [
        {
          "name": "Courtland Sutton",
          "position": "WR",
          "team": "DEN",
          "age": 30,
          "careerStage": "Prime Years"
        }
      ],
      "gives": [
        {
          "name": "Chris Godwin",
          "position": "WR",
          "team": "TB",
          "age": 29,
          "careerStage": "Prime Years"
        }
      ]
    }
  ],
  "draftPicks": [],
  "persona": "Todd McShay",
  "analysis": "Look, I've been doing this a long time, and when I see a trade that makes me scratch my head from a pure value perspective, I have to call it like I see it. What we have here is \"The Lateral Lifer\" in Shogunation making a move that screams desperation masked as optimization, trading away Courtland Sutton for Chris Godwin straight up. And on the other side? That's \"The Value Vulture\" in mastab24, circling around and pouncing on an opportunity to add 796 points of dynasty value to their roster. This is asset management 101, folks – you don't give up the more valuable piece without getting draft capital back to even things out.\n\nHere's what concerns me about Shogunation's logic: Yes, Godwin averaged 9.4 PPG compared to Sutton's 7.3 last season, but we're talking about a dynasty format here. Sutton is valued at 1,291 dynasty points for a reason – he's tied to a franchise that just invested heavily in young quarterback talent, while Godwin is heading into his age-29 season in a Tampa Bay offense that's completely in flux. The risk/reward here is all wrong for Shogunation. They're sitting at a respectable #4 power ranking at 76.4, but this move drops them 0.8 points. In a competitive league, that's the difference between a first-round bye and a Wild Card matchup. You're chasing last year's production instead of building for sustained success, and that's how contenders become pretenders real fast.\n\nNow let's talk about mastab24 – this is the kind of opportunistic move that championship teams make. They're ranked #5 with a 64.6 power score, and they desperately needed a boost. Their depth score of 26.7 is anemic, ranked near the bottom of the league, so adding a player with Sutton's dynasty value without giving up picks? That's what I call a \"steal in broad daylight.\" The Value Vulture saw a team overthinking things and capitalized. Sutton's in his prime years at 30, still has the physical tools, and most importantly, he fits the scheme in Denver with Sean Payton scheming him open. Godwin? He's dealing with quarterback uncertainty and coming off an ACL tear that clearly still affects his dynasty value. This is best player available thinking – take the better asset and figure out the fit later.\n\nThe championship implications here are significant, and I've got to tell you, mastab24 just improved their title odds while Shogunation hurt theirs. When you're a balanced trader making only your second move all-time, you can't afford to whiff on value like this. Shogunation needed to be extracting picks or a young upside piece to justify moving Sutton. Instead, they're banking on Godwin recapturing magic in a situation that's deteriorating. Meanwhile, The Value Vulture just added nearly 800 points of dynasty value and improved their power score by the exact amount their opponent lost. That's not a trade – that's a transfer of championship equity from one roster to another. If I'm advising Shogunation, I'm telling them this was a reach for short-term production that mortgages your future. And if I'm mastab24? I'm sending a thank-you note and looking for the next owner willing to sell low on quality assets.",
  "generatedAt": "2025-12-29T01:52:26.599Z"
}